/*
* 프로그램명: 반복문 구구단
* 작성자: yeonmew
* 작성일:2022-09-30
*/

#include<stdio.h>

int main(void) {
	int i, num = 0, case_num; //반복문, 구구단 숫자, 반복 횟수, 케이스번호

	printf("출력종류의 번호를 입력하시오.\n");
	printf("(1:모두, 2:짝수단, 3:홀수단): ");
	scanf_s("%d", &case_num);//케이스번호 입력받기

while(1){
	switch (case_num) {
	case 1: //모두
			printf("2 * 2 = 4\n\
3 * 1 = 3\n\
3 * 3 = 9\n\n\
4 * 2 = 8\n\
4 * 4 = 16\n\n\
5 * 1 = 5\n\
5 * 3 = 15\n\
5 * 5 = 25\n\n\
6 * 2 = 12\n\
6 * 4 = 24\n\
6 * 6 = 36\n\n\
7 * 1 = 7\n\
7 * 3 = 21\n\
7 * 5 = 35\n\
7 * 7 = 49\n\n\
8 * 2 = 16\n\
8 * 4 = 32\n\
8 * 6 = 48\n\
8 * 8 = 64\n\n\
9 * 1 = 9\n\
9 * 3 = 27\n\
9 * 5 = 45\n\
9 * 7 = 63\n\
9 * 9 = 81\n\n");
		num += 1;
		printf("반복문 수행 횟수: %d", num);
		exit(0);

	case 2: //짝수단
		printf("2 * 2 = 4\n\n\
4 * 2 = 8\n\
4 * 4 = 16\n\n\
6 * 2 = 12\n\
6 * 4 = 24\n\
6 * 6 = 36\n\n\
8 * 2 = 16\n\
8 * 4 = 32\n\
8 * 6 = 48\n\
8 * 8 = 64\n\n");
			num += 1;
		printf("반복문 수행 횟수: %d", num);
		exit(0);

	case 3: //홀수단
		printf("3 * 1 = 3\n\
3 * 3 = 9\n\n\
5 * 1 = 5\n\
5 * 3 = 15\n\
5 * 5 = 25\n\n\
7 * 1 = 7\n\
7 * 3 = 21\n\
7 * 5 = 35\n\
7 * 7 = 49\n\n\
9 * 1 = 9\n\
9 * 3 = 27\n\
9 * 5 = 45\n\
9 * 7 = 63\n\
9 * 9 = 81\n\n");
			num += 1;
		printf("반복문 수행 횟수: %d", num);
		exit(0);

	default: //그 외
		printf("출력번호를 잘못 누르셨군요!");
	}
}
	return 0;
}